# ЛАБОРАТОРНАЯ РАБОТА №2 РАБОТА С ФАЙЛАМИ В PYTHON. 
# Вариант 4. Вычисление массы протеинов. (￣o￣) . z Z

# Цель
Вычислить вес взвешенной строки (сумму весов её символов). 


## Задача
Изучить взвешенные строки
По исследованным строкам написать программу:

1.Реализовать метод инициализации данных.

2.Алгоритм подсчёта последовательности.

3.Протестировать реализованный алгоритм и выходные данные.

4.Проверить быстродействие кода (ЦИКЛОМАТИЧЕСКАЯ СЛОЖНОСТЬ, ВЫЧИСЛИТЕЛЬНАЯ СЛОЖНОСТЬ, потребляемая память).

5.Реализовать вывод данных в консоль.

# Алгоритм и инструменты
1.Реализация метода инициализации данных
-
Использоваk словарь nucleotide, где ключ - однобуквенный код аминокислоты, значение - её молекулярная масса.


2.Алгоритм подсчёта последовательности
-
Ввод последовательности пользователем с помощью функции input().

Очистка строки от пробелов и преобразование к верхнему регистру для корректного сопоставления с ключами словаря.

Вычисление суммарной массы с помощью функции sum(), перебирающей все символы последовательности и суммирующей соответствующие массы из словаря.

3. Тестирование реализованного алгоритма и выходных данных
Проверка на корректный ввод: последовательность из допустимых символов.

Обработка ошибок при вводе недопустимых символов (например, через конструкцию try-except).
### ошибки и их устранение:
Обработка регистра символов
-
Пользователь может ввести последовательность в нижнем регистре ('acde'), а в словаре ключи - заглавные буквы.

В текущем виде при вводе строчных символов возникнет ошибка KeyError.

### Исправление: привести ввод к верхнему регистру.

    pr = input('Введите свою последовательность:').strip().upper()


Обработка недопустимых символов
-
Если пользователь введёт символ, которого нет в словаре (например, 'X'), программа упадёт с ошибкой KeyError.

Это плохо с точки зрения удобства пользователя.

### Исправление: использовать конструкцию try-except для отлова ошибок и вывода понятного сообщения.

    try:
        mass_of_pr = sum(nucleotide[el] for el in pr)
    except KeyError as e:
        print(f"Ошибка: аминокислота '{e.args[0]}' не распознана.")
        exit(1)


Для функции reccurent_rel - 3.

Для основного блока - 4.

Общая цикломатическая сложность кода - 7.


4. Проверка быстродействия кода
Цикломатическая сложность: 2 (один блок try-except и один цикл суммирования).

Вычислительная сложность: O(n), где n - длина последовательности (итерация по всем символам).

Потребляемая память: O(1) для хранения словаря (фиксированного размера) и O(n) для строки последовательности, вводимой пользователем.

5. Реализация вывода данных в консоль
Вывод результата с помощью функции print() в читаемом формате:




Итог
В ходе лабораторной работы была создана программа, позволяющая быстро и корректно вычислять молекулярную массу аминокислотной последовательности. Программа устойчива к ошибкам ввода и информирует пользователя о некорректных символах. Анализ сложности показал, что алгоритм эффективен и подходит для обработки последовательностей любой длины.

**Данные для проверки находятся в отдельной папке с тем же названием.**

# Алгоритм, инструменты
Для начала получил данные о моноизотопных остатках аминокислот и загрузил для каждой вес. Источник (Московский государственный университет имени М.В. Ломоносова, "Определение молекулярной массы пептидов и белков методом масс-спектрометрии" (2015), из которого брал эти массы находится по ссылке: https://www.chem.msu.ru/rus/theses/2015/2015-10-20-berizovskaya/fulltext.pdf . В нём приведены данные о моноизотопных массах аминокислот и их использовании в расчётах.

### ошибки и их устранение:
Обработка регистра символов
-
Пользователь может ввести последовательность в нижнем регистре ('acde'), а в словаре ключи - заглавные буквы.

В текущем виде при вводе строчных символов возникнет ошибка KeyError.

### Исправление: привести ввод к верхнему регистру.

    pr = input('Введите свою последовательность:').strip().upper()


Обработка недопустимых символов
-
Если пользователь введёт символ, которого нет в словаре (например, 'X'), программа упадёт с ошибкой KeyError.

Это плохо с точки зрения удобства пользователя.

### Исправление: использовать конструкцию try-except для отлова ошибок и вывода понятного сообщения.

    try:
        mass_of_pr = sum(nucleotide[el] for el in pr)
    except KeyError as e:
        print(f"Ошибка: аминокислота '{e.args[0]}' не распознана.")
        exit(1)


Для функции reccurent_rel - 3.

Для основного блока - 4.

Общая цикломатическая сложность кода - 7.

Спасибо за внимание! 
# **(ノω<。)ノ))☆.。**









